#5. Написать программу вычисления значения функции y = f(a)
import math
def find_cosinus(x):
    return f'cos{x} = {math.cos(x)}'

d = int(input('число = '))
print(find_cosinus(d))